CC-Playgound/CC23xx_27xx_ble_extra_demos/examples/rtos/Connection_Monitor/CM_UART/CM_UART.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/ti/boards/LP_EM_CC2745R10_Q1" --device "CC2745R10RHAQ1" --part "Default" --package "RHA" --rtos "freertos" --product "simplelink_lowpower_f3_source_sdk@9.20.00.81"
 * @v2CliArgs --board "/ti/boards/LP_EM_CC2745R10_Q1" --device "CC2745R10-Q1" --package "VQFN (RHA)" --rtos "freertos" --product "simplelink_lowpower_f3_source_sdk@9.20.00.81"
 * @versions {"tool":"1.26.3+4529"}
 */

/**
 * Import the modules used in this configuration.
 */
const FreeRTOS          = scripting.addModule("/freertos/FreeRTOS");
const ble               = scripting.addModule("/ti/ble/ble");
const CCFG              = scripting.addModule("/ti/devices/CCFG");
const rfdesign          = scripting.addModule("/ti/devices/radioconfig/rfdesign");
const Display           = scripting.addModule("/ti/display/Display");
const Display1          = Display.addInstance();
const GPIO              = scripting.addModule("/ti/drivers/GPIO");
const GPIO1             = GPIO.addInstance();
const GPIO2             = GPIO.addInstance();
const NVS               = scripting.addModule("/ti/drivers/NVS");
const NVS1              = NVS.addInstance();
const Power             = scripting.addModule("/ti/drivers/Power");
const RCL               = scripting.addModule("/ti/drivers/RCL");
const RNG               = scripting.addModule("/ti/drivers/RNG");
const UART2             = scripting.addModule("/ti/drivers/UART2", {}, false);
const UART21            = UART2.addInstance();
const Button            = scripting.addModule("/ti/drivers/apps/Button", {}, false);
const Button1           = Button.addInstance();
const Button2           = Button.addInstance();
const LogModule         = scripting.addModule("/ti/log/LogModule", {}, false);
const LogModule1        = LogModule.addInstance();
const LogSinkTraceLPF3  = scripting.addModule("/ti/log/LogSinkTraceLPF3", {}, false);
const LogSinkTraceLPF31 = LogSinkTraceLPF3.addInstance();
const Settings          = scripting.addModule("/ti/posix/freertos/Settings");

/**
 * Write custom configuration values to the imported modules.
 */
FreeRTOS.heapSize       = 0x00010000;
FreeRTOS.timerStackSize = 0x00000190;
FreeRTOS.idleStackSize  = 0x00000130;

ble.basicBLE                                                   = true;
ble.disDevBySerUuid                                            = true;
ble.numOfAdvSets                                               = 1;
ble.connectionMonitorRole                                      = true;
ble.maxConnNum                                                 = 4;
ble.addressMode                                                = "ADDRMODE_PUBLIC";
ble.bondIOCaps                                                 = "GAPBOND_IO_CAP_NO_INPUT_NO_OUTPUT";
ble.eccDebugKeys                                               = true;
ble.deviceName                                                 = "Basic BLE RSSI";
ble.bondPairing                                                = "GAPBOND_PAIRING_MODE_INITIATE";
ble.defaultTxPowerValue                                        = "10";
ble.radioConfig.codeExportConfig.$name                         = "ti_devices_radioconfig_code_export_param0";
ble.adcNoiseConfig.codeExportConfig.$name                      = "ti_devices_radioconfig_code_export_param1";
ble.bleCsConfig.codeExportConfig.$name                         = "ti_devices_radioconfig_code_export_param2";
ble.connUpdateParamsPeripheral.$name                           = "ti_ble_general_ble_conn_update_params0";
ble.advSet1.$name                                              = "ti_ble_broadcaster_advertisement_set0";
ble.advSet1.advParam1.$name                                    = "ti_ble_broadcaster_advertisement_params0";
ble.advSet1.advParam1.primIntMin                               = 30;
ble.advSet1.advParam1.primIntMax                               = 30;
ble.advSet1.advData1.$name                                     = "ti_ble_broadcaster_advertisement_data0";
ble.advSet1.advData1.GAP_ADTYPE_16BIT_MORE                     = true;
ble.advSet1.advData1.numOfUUIDs16More                          = 1;
ble.advSet1.advData1.UUID016More                               = 0xFFF0;
ble.advSet1.scanRes1.$name                                     = "ti_ble_broadcaster_advertisement_data1";
ble.advSet1.scanRes1.GAP_ADTYPE_PERIPHERAL_CONN_INTERVAL_RANGE = true;
ble.rng.$name                                                  = "CONFIG_RNG_0";
ble.aesccm.$name                                               = "CONFIG_AESCCM_0";
ble.ecdh.$name                                                 = "CONFIG_ECDH_0";
ble.aesctrdrbg.$name                                           = "CONFIG_AESCTRDRBG_0";
ble.aesecb.$name                                               = "CONFIG_AESECB_0";

CCFG.ccfgTemplate.$name = "ti_devices_CCFG_CCFGCC27XXTemplate0";

Display1.$name                    = "CONFIG_Display_0";
Display1.$hardware                = system.deviceData.board.components.XDS110UART;
Display1.uartBufferSize           = 128;
Display1.uart.$name               = "CONFIG_UART2_0";
Display1.uart.txPinInstance.$name = "CONFIG_PIN_UART_TX";

GPIO1.$hardware = system.deviceData.board.components.LED_GREEN;
GPIO1.$name     = "CONFIG_GPIO_LED_GREEN";

GPIO2.$hardware = system.deviceData.board.components.LED_RED;
GPIO2.$name     = "CONFIG_GPIO_LED_RED";

NVS1.$name                    = "CONFIG_NVSINTERNAL";
NVS1.internalFlash.$name      = "ti_drivers_nvs_NVSLPF30";
NVS1.internalFlash.regionBase = 0xE5000;
NVS1.internalFlash.regionSize = 0x3000;

RCL.useCase = ["rfDebugSignals"];

RNG.rngReturnBehavior = "RNG_RETURN_BEHAVIOR_BLOCKING";

UART21.$name = "CONFIG_UART2_1";

Button1.$name     = "CONFIG_BUTTON_0";
Button1.$hardware = system.deviceData.board.components["BTN-1"];

Button2.$name     = "CONFIG_BUTTON_1";
Button2.$hardware = system.deviceData.board.components["BTN-2"];

const AESCommonXXF3 = scripting.addModule("/ti/drivers/cryptoutils/aes/AESCommonXXF3", {}, false);

LogModule1.$name      = "LogModule0";
LogModule1.loggerSink = "/ti/log/LogSinkTraceLPF3";

LogSinkTraceLPF31.$name                    = "CONFIG_ti_log_LogSinkTraceLPF3_0";
LogModule1.logger                          = LogSinkTraceLPF31;
LogSinkTraceLPF31.lrfGpio.tracePin.$assign = "boosterpack.32";

/**
 * References between modules.
 */
CCFG.defaultLfoscCompProfile = null;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Display1.uart.uart.$suggestSolution                  = "UART0";
Display1.uart.uart.dmaTxChannel.$suggestSolution     = "DMA_CH2";
Display1.uart.uart.dmaRxChannel.$suggestSolution     = "DMA_CH3";
Display1.uart.uart.txPin.$suggestSolution            = "boosterpack.4";
GPIO1.gpioPin.$suggestSolution                       = "boosterpack.19";
GPIO2.gpioPin.$suggestSolution                       = "boosterpack.36";
RCL.lrfGpio.$suggestSolution                         = "LRF";
RCL.lrfGpio.rfegpo0Pin.$suggestSolution              = "boosterpack.10";
RCL.lrfGpio.rfegpo1Pin.$suggestSolution              = "boosterpack.9";
UART21.uart.$suggestSolution                         = "UART1";
UART21.uart.dmaTxChannel.$suggestSolution            = "DMA_CH1";
UART21.uart.dmaRxChannel.$suggestSolution            = "DMA_CH0";
UART21.uart.txPin.$suggestSolution                   = "boosterpack.2";
UART21.uart.rxPin.$suggestSolution                   = "boosterpack.6";
Button1.button.$suggestSolution                      = "boosterpack.30";
Button2.button.$suggestSolution                      = "boosterpack.40";
AESCommonXXF3.laes.$suggestSolution                  = "LAES";
AESCommonXXF3.laes.dataLaesChannelA.$suggestSolution = "DMA_CH4";
AESCommonXXF3.laes.dataLaesChannelB.$suggestSolution = "DMA_CH5";
LogSinkTraceLPF31.lrfGpio.$suggestSolution           = "LRF";
